<a href="https://colab.research.google.com/github/karthikhub19/MachineLearningAlogs/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install mysql-connector-python

In [ ]:
import mysql.connector
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  #database='joins'
  
)

print(mydb)
mycursor = mydb.cursor(buffered=True)

#mycursor.execute("CREATE DATABASE guvi12") 
#create new db CREATE DATABASE mydatabase
#it willautomatically check if dbwith same name exists

<mysql.connector.connection.MySQLConnection object at 0x7f7ec316a970>

In [ ]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

#Show all existing db

('guvi1',)
('guvi12',)
('information_schema',)
('mysql',)
('newguvi',)
('performance_schema',)
('phpmyadmin',)
('test',)

In [ ]:
mycursor.execute("USE date1")

#change to another db if required

In [ ]:
#renaming the databse direct is not permitted since a lot of users arein the scene
mycursor.execute("CREATE DATABASE newguvi")

mycursor.execute("RENAME TABLE guvi1.customers TO newguvi.customers")

#so create a new db and rename the old tables(it will get transferred)

In [ ]:
mycursor.execute("DROP DATABASE guvi")
#delete any database

In [ ]:
mycursor.execute("CREATE TABLE yourtable1 (x INT(8) ZEROFILL)")
#usage of zerofill
#if input of 22 is given output will be 00000022

In [ ]:
mycursor.execute("CREATE TABLE lucky (salary INT(6),weight DECIMAL(3,3),insurance BOOLEAN)")

#decimal first value is total number of digits(including pre and post decimal digits) and swecond value is for after point 
#second value cannot be greater than first value

In [ ]:
#Alter table
#add a new column at first
mycursor.execute("ALTER TABLE lucky ADD covid VARCHAR(5) FIRST")

In [ ]:
#alter table
#add new column after some column name
mycursor.execute("ALTER TABLE lucky ADD covid_status VARCHAR(5) AFTER covid")
mydb.commit()

In [ ]:
#DROP column example
#The ROLLBACK command is the transactional command used to undo transactions that have not already been saved to the database.
mycursor.execute("ALTER TABLE lucky DROP COLUMN covid_status  ")
mydb.rollback()

In [ ]:
#MODIFY(tochange the definition of th column)
mycursor.execute("ALTER TABLE lucky MODIFY covid INT ")

In [ ]:
#rename column
mycursor.execute("ALTER TABLE lucky CHANGE COLUMN covid covidnew INT")

In [ ]:
#show tables
mycursor.execute("SHOW TABLES FROM guvi12")


for x in mycursor:
  print(x)

('forex',)
('lucky',)
('test2',)
('test_1',)

In [ ]:
#show tables
mycursor.execute("SHOW TABLES IN guvi12")


for x in mycursor:
  print(x)

('forex',)
('lucky',)
('test2',)
('test_1',)

In [ ]:
#show tables by using where
mycursor.execute("SHOW TABLES IN guvi12 WHERE Tables_in_guvi12= 'forex' ")
for x in mycursor:
  print(x)

('forex',)

In [ ]:
#truncate(delete all elements without deleting the table structure)
mycursor.execute("TRUNCATE test2")
mydb.commit

In [ ]:
mycursor.execute("CREATE TABLE date (datein DATE)")
#mycursor.execute("INSERT INTO date (datein) VALUES ( CURDATE())")

In [ ]:
mycursor.execute("INSERT INTO date (datein) VALUES ( CURDATE())")
mycursor.execute("INSERT INTO date (datein) VALUES ( CURRENT_DATE())")
mycursor.execute("INSERT INTO date (datein) VALUES (CURTIME())")
mycursor.execute("INSERT INTO date (datein) VALUES (CURRENT_TIMESTAMP())")
mycursor.execute("INSERT INTO date (datein) VALUES (CURRENT_TIME())")
mycursor.execute("INSERT INTO date (datein) VALUES (NOW())")
mydb.commit()

#whatever date format given into DATE datatypw will consider in the sameway

In [ ]:
mycursor.execute("CREATE TABLE datestrin (datein VARCHAR(255))")

In [ ]:
mycursor.execute("INSERT INTO datestrin (datein) VALUES ( CURDATE())")
mycursor.execute("INSERT INTO datestrin (datein) VALUES ( CURRENT_DATE())")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (CURTIME())")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (CURRENT_TIMESTAMP())")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (CURRENT_TIME())")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (NOW())")#date and time
mycursor.execute("INSERT INTO datestrin (datein) VALUES (MONTHNAME(NOW()))")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (DAYNAME(NOW()))")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (HOUR(NOW()))")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (MINUTE(NOW()))")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (DATE_ADD(NOW(),INTERVAL -10 DAY))")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (DATE_FORMAT(NOW(),'%W %D %M %Y %T %H'))")
mycursor.execute("INSERT INTO datestrin (datein) VALUES (UTC_DATE())")#UTC_TIME,UTC_TIMESTAMP
mydb.commit()

In [ ]:
mycursor.execute("CREATE TABLE blobtest1 (datein BLOB NOT NULL)")

In [ ]:
# Convert images or files data to binary format
def convert_data(file_name):
    with open(file_name, 'rb') as file:
        binary_data = file.read()
    return binary_data
a=convert_data("/home/linux/Desktop/logo.png")
#print(a)

query="""INSERT INTO blobtest (datein) VALUES (%s)"""
mycursor.execute(query,a)
mydb.commit()

In [ ]:
import mysql.connector
 
 
# Convert images or files data to binary format
def convert(file_name):
    with open(file_name, 'rb') as file:
        binary_data = file.read()
    return binary_data
 
 
try:
    connection = mysql.connector.connect(host='localhost',
                                         database='guvi12',
                                         user='root',
                                         password='')
    mycursor = connection.cursor()
    # create table query
    create_table = """CREATE TABLE blob11111( name VARCHAR (255) NOT NULL, profile_pic BLOB NOT NULL, \
    imp_files BLOB NOT NULL) """
 
    # Execute the create_table query first
    mycursor.execute(create_table)
    # printing successful message
    print("Table created Successfully")
 
    query = """ INSERT INTO blob11111( name, profile_pic, imp_files)VALUES ( %s,%s,%s)"""
 
    # First Data Insertion
    name = "nethaji"
    picture = convert_data("/home/linux/Desktop/logo.png")
    text_file = convert_data('/home/linux/Desktop/Android.pdf')
 
    # Inserting the data in database in tuple format
    result = mycursor.execute(
        query, (name, picture, text_file))
    # Committing the data
    connection.commit()
    print("Successfully Inserted Values")
 
# Print error if occured
except mysql.connector.Error as error:
    print(format(error))
 
finally:
   
    # Closing all resources
    if connection.is_connected():
       
        mycursor.close()
        connection.close()
        print("MySQL connection is closed")

Table created Successfully
Successfully Inserted Values
MySQL connection is closed

#select and view

In [ ]:
!pip install tabulate

None

In [ ]:
#mycursor.execute("SELECT * FROM diabetes WHERE Pregnancies=1")
mycursor.execute("select count(Pregnancies) from diabetes where Pregnancies =1")
mycursor.execute("select count(Pregnancies) from diabetes where outcome = 1 and Pregnancies = 2 ")

#mycursor.execute("SELECT Insulin,BMI,Age FROM diabetes")
#mycursor.execute("SELECT count( * ) as total_record FROM diabetes")
out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+----------------------+
|   count(Pregnancies) |
|----------------------|
|                   19 |
+----------------------+

In [ ]:
mycursor.execute("SELECT * FROM diabetes WHERE Pregnancies=1 ORDER BY BMI")

out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

In [ ]:
#mycursor.execute("SELECT * FROM diabetes GROUP BY Pregnancies ")
#for x in mycursor:
# print(x)
mycursor.execute("SELECT count(*) FROM diabetes GROUP BY pregnancies ")
out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],showindex="always",  tablefmt='psql'))

+----+------------+
|    |   count(*) |
|----+------------|
|  0 |        111 |
|  1 |        135 |
|  2 |         24 |
|  3 |         11 |
|  4 |          9 |
|  5 |         10 |
|  6 |          2 |
|  7 |          1 |
|  8 |          1 |
|  9 |        103 |
| 10 |         75 |
| 11 |         68 |
| 12 |         57 |
| 13 |         50 |
| 14 |         45 |
| 15 |         38 |
| 16 |         28 |
| 17 |          1 |
+----+------------+

# constraints

# Constraints
NOT NULL - Ensures that a column cannot have a NULL value

UNIQUE - Ensures that all values in a column are different

PRIMARY KEY - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table

FOREIGN KEY - Prevents actions that would destroy links between tables

CHECK - Ensures that the values in a column satisfies a specific condition

DEFAULT - Sets a default value for a column if no value is specified

CREATE INDEX - Used to create and retrieve data from the database very quickly

In [ ]:
#NOT NULL
mycursor.execute("CREATE TABLE stu1 (no INTEGER,name TEXT NOT NULL,school VARCHAR(20)) ")

In [ ]:
a=input()
b=input()
c=input()
query="INSERT INTO stu1 (no,name,school) VALUES (%s,%s,%s)"
mycursor.execute(query,(a,b,c))
mydb.commit()

KeyboardInterrupt: ignored

In [ ]:
#unique and check
mycursor.execute("CREATE TABLE u (no INTEGER,name TEXT UNIQUE,school VARCHAR(20),age INT CHECK(age<18)) ")

In [ ]:
a=input()
b=input()
c=input()
d=input()
query="INSERT INTO u (no,name,school,age) VALUES (%s,%s,%s,%s)"
mycursor.execute(query,(a,b,c,d))
mydb.commit()
#duplicate entry error

1
nirmal
park
15

In [ ]:
#creating an index which is not visible
mycursor.execute("CREATE INDEX user_id ON test2 (accno, name)")

In [ ]:
mycursor.execute("SHOW INDEXES FROM u ")
out=mycursor.fetchall()
print(out)
from tabulate import tabulate
print(tabulate(out, tablefmt='psql'))

[('u', 0, 'name', 1, 'name', 'A', None, None, None, 'YES', 'HASH', '', '')]
+---+---+------+---+------+---+--+--+--+-----+------+--+--+
| u | 0 | name | 1 | name | A |  |  |  | YES | HASH |  |  |
+---+---+------+---+------+---+--+--+--+-----+------+--+--+

In [ ]:
mydb.commit()

# PRIMARY KEY 
Constraint
This constraint is used to identify each record in a table uniquely. If the column contains primary key constraints, then it cannot be null or empty. A table may have duplicate columns, but it can contain only one primary key. It always contains unique value into a column

#Foreign Key Constraint
This constraint is used to link two tables together. It is also known as the referencing key. A foreign key column matches the primary key field of another table. It means a foreign key field in one table refers to the primary key field of another table


A FOREIGN KEY constraint does not have to be linked only to a PRIMARY KEY constraint in another table; it can also be defined to reference the columns of a UNIQUE constraint in another table.

In [ ]:
mycursor.execute("CREATE TABLE aadhardetails (name VARCHAR(30),ADDRESS VARCHAR(20),AADHARID INTEGER PRIMARY KEY)")

In [ ]:
mycursor.execute("INSERT INTO aadhardetails (name,address,aadharid) VALUES('netthaji','coimbatore',22345678)")

In [ ]:
mydb.commit()

In [ ]:
mycursor.execute("CREATE TABLE bankacc(name VARCHAR(20),type VARCHAR(2),accno INT PRIMARY KEY,aadhar INT ,FOREIGN KEY (aadhar)REFERENCES aadhardetails(aadharid))")

In [ ]:
mycursor.execute("INSERT INTO bankacc (name,type,accno,aadhar) VALUES('nethaji','fd',123455,12345678)")

In [ ]:
mydb.commit()

In [ ]:
mycursor.execute("CREATE TABLE pancard(name VARCHAR(20),dob INT,panid VARCHAR(16),aadhar INT ,FOREIGN KEY(aadhar) REFERENCES aadhardetails(aadharid),PRIMARY KEY(panid,aadhar))")

In [ ]:
mycursor.execute("INSERT INTO pancard(name,dob,panid,aadhar) VALUES('nethaji',123,'BABPN78',12345678)")

In [ ]:
mydb.commit()

In [ ]:
!pip3 install tabulate

Requirement already satisfied: tabulate in ./.local/lib/python3.8/site-packages (0.8.9)

In [ ]:
mycursor.execute("DESCRIBE test")
out=mycursor.fetchall()
print(out)
from tabulate import tabulate
print(tabulate(out, headers=['accno', 'name','empdomain','age'], tablefmt='psql'))

[('accno', 'int(11)', 'NO', 'PRI', None, ''), ('name', 'text', 'YES', '', None, ''), ('empdoamin', 'varchar(20)', 'YES', '', None, ''), ('age', 'int(11)', 'YES', '', None, '')]
+-----------+-------------+---------+--------+-------------+-------+
|           |             | accno   | name   | empdomain   | age   |
|-----------+-------------+---------+--------+-------------+-------|
| accno     | int(11)     | NO      | PRI    |             |       |
| name      | text        | YES     |        |             |       |
| empdoamin | varchar(20) | YES     |        |             |       |
| age       | int(11)     | YES     |        |             |       |
+-----------+-------------+---------+--------+-------------+-------+

# Partitions
latest mysql doesnt support vertical partioning

partitions can be enablesd and disables

In [ ]:
mycursor.execute("SET @@global.sql_mode= ''")

In [ ]:
# use football databse
#to import big files change conf file as follows
#SET @@global.sql_mode= '';    ----exec command

#set global net_buffer_length=1000000; 
#set global max_allowed_packet=1000000000; 
mycursor.execute("CREATE TABLE crypto(timestamp INT,open DOUBLE ,close INT,high DOUBLE,low DOUBLE,volume DOUBLE)")

In [ ]:
#by default we have varchar from dataset and it should bechanged to int for this operation
mycursor.execute(" ALTER TABLE forex\
PARTITION BY RANGE (close) (\
      partition p0 VALUES LESS THAN (10000),\
      partition p1 VALUES LESS THAN (20000),\
      partition p2 VALUES LESS THAN (30000),\
      partition p3 VALUES LESS THAN (40000),\
      partition p4 VALUES LESS THAN (50000),\
      partition p5 VALUES LESS THAN (60000),\
      partition p6 VALUES LESS THAN  MAXVALUE\
  )")
mydb.commit()

In [ ]:
#lets check
mycursor.execute("SELECT * FROM information_schema.partitions WHERE TABLE_SCHEMA='guvi1' ")
out=mycursor.fetchall()
print(out)
from tabulate import tabulate
print(tabulate(out,  tablefmt='psql'))

[('def', 'guvi1', 'aadhardetails', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 0, 0, datetime.datetime(2022, 1, 21, 11, 44, 33), None, None, None, '', '', None), ('def', 'guvi1', 'bankacc', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 16384, 0, datetime.datetime(2022, 1, 21, 11, 52, 4), None, None, None, '', '', None), ('def', 'guvi1', 'blobtest1', None, None, None, None, None, None, None, None, None, 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 20, 11, 42, 15), None, None, None, '', '', None), ('def', 'guvi1', 'cons', None, None, None, None, None, None, None, None, None, 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 20, 10, 44, 6), None, None, None, '', '', None), ('def', 'guvi1', 'date', None, None, None, None, None, None, None, None, None, 7, 2340, 16384, None, 0, 0, datetime.datetime(2022, 1, 12, 0, 50, 57), datetime.datetime(2022, 1, 24, 8, 27, 6), None, None, '', '', None), ('def', 'guvi1', 'date1', None, None, None, None, None, None, None, None, None, 4, 4096, 16384, None, 0, 0, datetime.datetime(2022, 1, 12, 0, 49, 33), datetime.datetime(2022, 1, 24, 8, 27, 6), None, None, '', '', None), ('def', 'guvi1', 'datestrin', None, None, None, None, None, None, None, None, None, 13, 1260, 16384, None, 0, 0, datetime.datetime(2022, 1, 20, 11, 17, 45), None, None, None, '', '', None), ('def', 'guvi1', 'diabetes', None, None, None, None, None, None, None, None, None, 769, 106, 81920, None, 0, 0, datetime.datetime(2022, 1, 18, 7, 35, 12), None, None, None, '', '', None), ('def', 'guvi1', 'employee', None, None, None, None, None, None, None, None, None, 8, 2048, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 7, 26, 46), datetime.datetime(2022, 1, 24, 8, 18, 56), None, None, '', '', None), ('def', 'guvi1', 'forex', 'p0', None, 1, None, 'RANGE', None, '`close`', None, '10000', 14572, 109, 1589248, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'forex', 'p1', None, 2, None, 'RANGE', None, '`close`', None, '20000', 2751, 95, 262144, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'forex', 'p2', None, 3, None, 'RANGE', None, '`close`', None, '30000', 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'forex', 'p3', None, 4, None, 'RANGE', None, '`close`', None, '40000', 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'forex', 'p4', None, 5, None, 'RANGE', None, '`close`', None, '50000', 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'forex', 'p5', None, 6, None, 'RANGE', None, '`close`', None, '60000', 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'forex', 'p6', None, 7, None, 'RANGE', None, '`close`', None, 'MAXVALUE', 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 56, 45), None, None, None, '', 'default', None), ('def', 'guvi1', 'lucky', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 0, 0, datetime.datetime(2022, 1, 12, 0, 2, 52), None, None, None, '', '', None), ('def', 'guvi1', 'lucky1', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 0, 0, datetime.datetime(2022, 1, 20, 10, 9, 4), None, None, None, '', '', None), ('def', 'guvi1', 'mytable', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 0, 0, datetime.datetime(2022, 1, 20, 9, 48, 20), None, None, None, '', '', None), ('def', 'guvi1', 'nethaji', None, None, None, None, None, None, None, None, None, 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 12, 0, 25, 55), None, None, None, '', '', None), ('def', 'guvi1', 'stu1', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 0, 0, datetime.datetime(2022, 1, 24, 9, 21, 34), datetime.datetime(2022, 1, 24, 9, 22, 22), None, None, '', '', None), ('def', 'guvi1', 'u', None, None, None, None, None, None, None, None, None, 2, 8192, 16384, None, 16384, 0, datetime.datetime(2022, 1, 24, 9, 24, 29), datetime.datetime(2022, 1, 24, 9, 26, 35), None, None, '', '', None), ('def', 'guvi1', 'yourtable', None, None, None, None, None, None, None, None, None, 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 11, 23, 55, 23), None, None, None, '', '', None), ('def', 'guvi1', 'yourtable1', None, None, None, None, None, None, None, None, None, 0, 0, 16384, None, 0, 0, datetime.datetime(2022, 1, 11, 23, 56, 22), None, None, None, '', '', None)]
+-----+-------+---------------+----+--+---+--+-------+--+---------+--+----------+-------+------+---------+--+-------+---+---------------------+---------------------+--+--+--+---------+--+
| def | guvi1 | aadhardetails |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  |     0 | 0 | 2022-01-21 11:44:33 |                     |  |  |  |         |  |
| def | guvi1 | bankacc       |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  | 16384 | 0 | 2022-01-21 11:52:04 |                     |  |  |  |         |  |
| def | guvi1 | blobtest1     |    |  |   |  |       |  |         |  |          |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-20 11:42:15 |                     |  |  |  |         |  |
| def | guvi1 | cons          |    |  |   |  |       |  |         |  |          |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-20 10:44:06 |                     |  |  |  |         |  |
| def | guvi1 | date          |    |  |   |  |       |  |         |  |          |     7 | 2340 |   16384 |  |     0 | 0 | 2022-01-12 00:50:57 | 2022-01-24 08:27:06 |  |  |  |         |  |
| def | guvi1 | date1         |    |  |   |  |       |  |         |  |          |     4 | 4096 |   16384 |  |     0 | 0 | 2022-01-12 00:49:33 | 2022-01-24 08:27:06 |  |  |  |         |  |
| def | guvi1 | datestrin     |    |  |   |  |       |  |         |  |          |    13 | 1260 |   16384 |  |     0 | 0 | 2022-01-20 11:17:45 |                     |  |  |  |         |  |
| def | guvi1 | diabetes      |    |  |   |  |       |  |         |  |          |   769 |  106 |   81920 |  |     0 | 0 | 2022-01-18 07:35:12 |                     |  |  |  |         |  |
| def | guvi1 | employee      |    |  |   |  |       |  |         |  |          |     8 | 2048 |   16384 |  |     0 | 0 | 2022-01-24 07:26:46 | 2022-01-24 08:18:56 |  |  |  |         |  |
| def | guvi1 | forex         | p0 |  | 1 |  | RANGE |  | `close` |  | 10000    | 14572 |  109 | 1589248 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | forex         | p1 |  | 2 |  | RANGE |  | `close` |  | 20000    |  2751 |   95 |  262144 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | forex         | p2 |  | 3 |  | RANGE |  | `close` |  | 30000    |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | forex         | p3 |  | 4 |  | RANGE |  | `close` |  | 40000    |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | forex         | p4 |  | 5 |  | RANGE |  | `close` |  | 50000    |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | forex         | p5 |  | 6 |  | RANGE |  | `close` |  | 60000    |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | forex         | p6 |  | 7 |  | RANGE |  | `close` |  | MAXVALUE |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-24 09:56:45 |                     |  |  |  | default |  |
| def | guvi1 | lucky         |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  |     0 | 0 | 2022-01-12 00:02:52 |                     |  |  |  |         |  |
| def | guvi1 | lucky1        |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  |     0 | 0 | 2022-01-20 10:09:04 |                     |  |  |  |         |  |
| def | guvi1 | mytable       |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  |     0 | 0 | 2022-01-20 09:48:20 |                     |  |  |  |         |  |
| def | guvi1 | nethaji       |    |  |   |  |       |  |         |  |          |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-12 00:25:55 |                     |  |  |  |         |  |
| def | guvi1 | stu1          |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  |     0 | 0 | 2022-01-24 09:21:34 | 2022-01-24 09:22:22 |  |  |  |         |  |
| def | guvi1 | u             |    |  |   |  |       |  |         |  |          |     2 | 8192 |   16384 |  | 16384 | 0 | 2022-01-24 09:24:29 | 2022-01-24 09:26:35 |  |  |  |         |  |
| def | guvi1 | yourtable     |    |  |   |  |       |  |         |  |          |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-11 23:55:23 |                     |  |  |  |         |  |
| def | guvi1 | yourtable1    |    |  |   |  |       |  |         |  |          |     0 |    0 |   16384 |  |     0 | 0 | 2022-01-11 23:56:22 |                     |  |  |  |         |  |
+-----+-------+---------------+----+--+---+--+-------+--+---------+--+----------+-------+------+---------+--+-------+---+---------------------+---------------------+--+--+--+---------+--+

In [ ]:
#check also with wrong linits eg:35000 and 38000-->will return empty

mycursor.execute(" SELECT * FROM forex PARTITION (p1) WHERE close BETWEEN 10000 and 11000")
out=mycursor.fetchall()
print("Total number of rows in table: ", mycursor.rowcount)
print(out)
from tabulate import tabulate
print(tabulate(out, tablefmt='psql'))

# joins

In [ ]:
#to import using python need to create table with all column names
#mycursor.execute("LOAD DATA INFILE '/home/linux/Desktop/pima-indians-diabetes.data.csv' INTO TABLE test2")
#mydb.commit()

In [ ]:
mycursor.execute("CREATE TABLE students(ID INT PRIMARY KEY,NAME VARCHAR(20),PH INT) ")

In [ ]:
mycursor.execute("INSERT INTO students (ID,NAME,PH) VALUES(1,'nethaji',12345)")

In [ ]:
mycursor.execute("INSERT INTO students (ID,NAME,PH) VALUES(2,'nirmal',123456)")

In [ ]:
mydb.commit()

In [ ]:
mycursor.execute("CREATE TABLE marks(ID INT ,maths int,phy INT,chem INT) ")
mydb.commit()

In [ ]:
mycursor.execute("INSERT INTO marks (ID,maths,phy,chem) VALUES(1,91,80,50)")
mydb.commit()

In [ ]:
#INNER JOIN

mycursor.execute("SELECT students.ID,joins.marks.maths,joins.marks.phy \
FROM students \
INNER JOIN joins.marks ON students.ID = joins.marks.ID")
out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,  tablefmt='psql'))

+---+----+----+
| 2 | 99 | 80 |
| 1 | 99 | 80 |
+---+----+----+

In [ ]:
mydb.commit()

In [ ]:
#joining columns from 3 different tables
mycursor.execute("SELECT students.ID, marks.maths,marks.chem,marks.phy,sports.100mts,sports.football \
FROM students \
INNER JOIN marks ON students.ID = marks.ID \
INNER JOIN sports ON students.ID = sports.id ")

out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,  tablefmt='psql'))

+---+----+----+----+---+---+
| 1 | 99 | 50 | 80 | 2 | 1 |
| 2 | 99 | 50 | 80 | 1 | 1 |
+---+----+----+----+---+---+

In [ ]:
#left join :eturns all rows from the left table, even if there are no matches in the right table
mycursor.execute("SELECT students.ID, marks.maths,marks.chem,marks.phy \
FROM students \
RIGHT JOIN marks ON students.ID = marks.ID")

out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+------+---------+--------+-------+
|   ID |   maths |   chem |   phy |
|------+---------+--------+-------|
|    2 |      99 |     50 |    80 |
|    1 |      99 |     50 |    80 |
|      |      25 |     45 |    35 |
+------+---------+--------+-------+

In [ ]:
mydb.commit()

In [ ]:
#RIGHT JOIN: returns all rows from the right table, even if there are no matches in the left table.

mycursor.execute("SELECT students.ID, marks.maths,marks.chem,marks.phy \
FROM students \
RIGHT JOIN marks ON students.ID = marks.ID")

out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+------+---------+--------+-------+
|   ID |   maths |   chem |   phy |
|------+---------+--------+-------|
|    2 |      99 |     50 |    80 |
|    1 |      99 |     50 |    80 |
|      |      25 |     45 |    35 |
+------+---------+--------+-------+

In [ ]:
mydb.commit()

In [ ]:
#FULL JOIN gets all records from both tables and puts NULL in the columns where related records do not exist in the opposite table

mycursor.execute("SELECT marks.maths,marks.chem,marks.phy \
FROM students \
FULL JOIN marks ")

out=mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+--------+-------+
|   maths |   chem |   phy |
|---------+--------+-------|
|      99 |     50 |    80 |
|      99 |     50 |    80 |
|      99 |     50 |    80 |
|      99 |     50 |    80 |
|      99 |     50 |    80 |
|      99 |     50 |    80 |
|      25 |     45 |    35 |
|      25 |     45 |    35 |
|      25 |     45 |    35 |
+---------+--------+-------+

#Triggers
A trigger is called a special procedure because it cannot be called directly like a stored procedure

Row-Level Trigger: It is a trigger, which is activated for each row by a triggering statement such as insert, update, or delete. For example, if a table has inserted, updated, or deleted multiple rows, the row trigger is fired automatically for each row affected by the insert, update, or delete statement.

In [ ]:
#(BEFOR | AFTER) table_name (INSERT | UPDATE | DELETE)  

mycursor.execute("CREATE TABLE employee(  \
    name varchar(45) NOT NULL,   \
    occupation varchar(35) NOT NULL,  working_date date, working_hours varchar(10)\
)  ")

In [ ]:
mycursor.execute("INSERT INTO employee VALUES    
('nethaji', 'Scientist', '2020-10-04', 12),  
('sandeep', 'Engineer', '2020-10-04', 10),  
('bharath', 'Actor', '2020-10-04', 13),  
('sailakshmi', 'Doctor', '2020-10-04', 14),  
('hariganesh', 'Teacher', '2020-10-04', 12),  
('tarun', 'Business', '2020-10-04', 11)  ")

In [ ]:
#creating trigger
mycursor.execute("DELIMITER// CREATE TRIGGER before_insert_empworkinghrs  \
BEFORE INSERT ON employee FOR EACH ROW \
BEGIN \
IF (NEW.working_hours < 0) THEN SET NEW.working_hours = 0; \
END IF;\
END// \
DELIMITER")